# Subcategory Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolicCurve..::..Subcategory Property
SymbolicCurve Class See Also
---
The subcategory.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GraphicsStyle Subcategory { get; set; }
```

Visual Basic
---
```text
Public Property Subcategory As GraphicsStyle
	Get
	Set
```

Visual C++
---
```text
public:
property GraphicsStyle^ Subcategory {
	GraphicsStyle^ get ();
	void set (GraphicsStyle^ value);
}
```

# Remarks
If the family category is non-cuttable, the subcategory can be set to be the family category or one of its subcategories. If the family category is cuttable, the subcategory can be set as the graphics styles of the family category, its subcategories, or the invisible lines graphics style.
# See Also
SymbolicCurve Class
Autodesk.Revit.DB Namespace